

DROP VIEW IF EXISTS `вирт_Направление_предварительно`;
CREATE VIEW `вирт_Направление_предварительно` AS
SELECT
  ``.`` AS `Ид\Направление`,
  ``.`` AS `Код направления`,
  ``.`` AS `Название направления`,
  ``.`` AS `Код факультета`,
  ``.`` AS `Название факультета`
FROM `` AS ``
LEFT JOIN `` AS `` ON ``.`` = ``.``
;

SELECT * FROM `вирт_Направление_предварительно`;


DROP PROCEDURE IF EXISTS `проц_Выбрано_абитуриентом_предварительно`;
CREATE PROCEDURE `проц_Выбрано_абитуриентом_предварительно`
 (IN `Ид\Направление` INT)
SELECT
  ``.`` AS `Код абитуриента`,
  ``.`` AS `ФИО абитуриента`,
  ``.`` AS `Код категории абитуриента`,
  ``.`` AS `Название категории абитуриента`,
  ``.`` AS `Рейтинг абитуриента`,
  ``.`` AS `Дата подачи документов`,
  ``.`` AS `Код секретаря (принял)`,
  ``.`` AS `ФИО секретаря`,
  ``.`` AS `Код должности секретаря`,
  ``.`` AS `Название должности секретаря`,
  ``.`` AS `Код кафедры`,
  ``.`` AS `Название кафедры`,
  ``.`` AS `Код факультета секретаря`,
  ``.`` AS `Название факультета секретаря`,
  ``.`` AS `Дата-время выбора`,
  ``.`` AS `Код секретаря (зарегистрировавшего выбор)`,
  ``.`` AS `Дата возврата документов`,
  ``.`` AS `Код секретаря (возвратившего документы)`
FROM `` AS ``
LEFT JOIN `` AS `` ON ``.`` = ``.``
WHERE ``.`` = `Ид\Направление`
;

CALL `проц_Выбрано_абитуриентом_предварительно`(1);
CALL `проц_Выбрано_абитуриентом_предварительно`(2);


DROP PROCEDURE IF EXISTS `проц_Документ_абитуриента`;
CREATE PROCEDURE `проц_Документ_абитуриента`
 (IN `Ид\Направление` INT)
SELECT
  ``.`` AS `Номер документа`,
  ``.`` AS `Код вида документа`,
  ``.`` AS `Название вида документа`,
  ``.`` AS `Реквизиты документа`,
FROM `` AS ``
LEFT JOIN `` AS `` ON ``.`` = ``.``
WHERE ``.`` = `Ид\Направление`
;

CALL `проц_Документ_абитуриента`(1);
CALL `проц_Документ_абитуриента`(2);


DROP VIEW IF EXISTS `вирт_Выбрано_абитуриентом%Направление_предварительно`;
CREATE VIEW `вирт_Выбрано_абитуриентом%Направление_предварительно` AS
SELECT
  ``.`` AS `Код направления`,
  ``.`` AS `Название направления`,
  ``.`` AS `Код факультета`,
  ``.`` AS `Название факультета`,
  ``.`` AS `Код абитуриента`,
  ``.`` AS `ФИО абитуриента`,
  ``.`` AS `Код категории абитуриента`,
  ``.`` AS `Название категории абитуриента`,
  ``.`` AS `Рейтинг абитуриента`,
  ``.`` AS `Дата подачи документов`,
  ``.`` AS `Код секретаря (принял)`,
  ``.`` AS `ФИО секретаря`,
  ``.`` AS `Код должности секретаря`,
  ``.`` AS `Название должности секретаря`,
  ``.`` AS `Код кафедры`,
  ``.`` AS `Название кафедры`,
  ``.`` AS `Дата-время выбора`,
  ``.`` AS `Код секретаря (зарегистрировавшего выбор)`,
  ``.`` AS `Дата возврата документов`,
  ``.`` AS `Код секретаря (возвратившего документы)`,
  ``.`` AS `Код факультета секретаря`,
  ``.`` AS `Название факультета секретаря`,
FROM `` AS ``
LEFT JOIN `` AS `` ON ``.`` = ``.``
;

SELECT * FROM `вирт_Выбрано_абитуриентом%Направление_предварительно`;


DROP VIEW IF EXISTS `вирт_Направление_предварительно_Кол-во`;
CREATE VIEW `вирт_Направление_предварительно_Кол-во` AS
SELECT
  ``.`` AS `Код факультета`,
  ``.`` AS `Название факультета`,
 COUNT(*) AS `Число направлений`
FROM `` AS ``
LEFT JOIN `` AS `` ON ``.`` = ``.``
;

SELECT * FROM `вирт_Направление_предварительно_Кол-во`;


